; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-20)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 room3)
(at ball8 room3)
(at ball9 room3)
(at ball10 room3)
(at ball11 room3)
(at ball12 room4)
(at ball13 room4)
(at ball14 room4)
(at ball15 room4)
(at ball16 room4)
(at ball17 room5)
(at ball18 room6)
(at ball19 room6)
(at ball20 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 roomb)
(at ball7 room3)
(at ball8 room3)
(at ball9 room3)
(at ball10 room3)
(at ball11 room4)
(at ball12 room4)
(at ball13 room5)
(at ball14 room5)
(at ball15 room5)
(at ball16 room5)
(at ball17 room6)
(at ball18 room6)
(at ball19 room6)
(at ball20 room6)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 12 of 20
2. (pick ball5 roomb left)
   deleted: (at ball5 roomb) (free left)
   added: (carry ball5 left)
   goals met: 12 of 20
3. (pick ball4 roomb right)
   deleted: (at ball4 roomb) (free right)
   added: (carry ball4 right)
   goals met: 12 of 20
4. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 12 of 20
5. (move room6 rooma)
   deleted: (at-robby room6)
   added: (at-robby rooma)
   goals met: 12 of 20
6. (drop ball4 rooma right)
   deleted: (carry ball4 right)
   added: (at ball4 rooma) (free right)
   goals met: 13 of 20
7. (drop ball5 rooma left)
   deleted: (carry ball5 left)
   added: (at ball5 rooma) (free left)
   goals met: 14 of 20
8. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 14 of 20
9. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 14 of 20
10. (pick ball17 room5 left)
   deleted: (at ball17 room5) (free left)
   added: (carry ball17 left)
   goals met: 14 of 20
11. (move room5 room6)
   deleted: (at-robby room5)
   added: (at-robby room6)
   goals met: 14 of 20
12. (drop ball17 room6 left)
   deleted: (carry ball17 left)
   added: (at ball17 room6) (free left)
   goals met: 15 of 20
13. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 15 of 20
14. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 15 of 20
15. (pick ball16 room4 left)
   deleted: (at ball16 room4) (free left)
   added: (carry ball16 left)
   goals met: 15 of 20
16. (pick ball15 room4 right)
   deleted: (at ball15 room4) (free right)
   added: (carry ball15 right)
   goals met: 15 of 20
17. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 15 of 20
18. (drop ball15 room5 right)
   deleted: (carry ball15 right)
   added: (at ball15 room5) (free right)
   goals met: 16 of 20
19. (drop ball16 room5 left)
   deleted: (carry ball16 left)
   added: (at ball16 room5) (free left)
   goals met: 17 of 20
20. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 17 of 20
21. (pick ball14 room4 left)
   deleted: (at ball14 room4) (free left)
   added: (carry ball14 left)
   goals met: 17 of 20
22. (pick ball13 room4 right)
   deleted: (at ball13 room4) (free right)
   added: (carry ball13 right)
   goals met: 17 of 20
23. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 17 of 20
24. (drop ball13 room5 right)
   deleted: (carry ball13 right)
   added: (at ball13 room5) (free right)
   goals met: 18 of 20
25. (drop ball14 room5 left)
   deleted: (carry ball14 left)
   added: (at ball14 room5) (free left)
   goals met: 19 of 20
26. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 19 of 20
27. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 19 of 20
28. (pick ball11 room3 left)
   deleted: (at ball11 room3) (free left)
   added: (carry ball11 left)
   goals met: 19 of 20
29. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 19 of 20
30. (drop ball11 room4 left)
   deleted: (carry ball11 left)
   added: (at ball11 room4) (free left)
   goals met: 20 of 20
